julsch90/nrf5_sdk_uwb_dw3xxx/projects/components/drivers_ext/DW3XXX_API/Sources/DW3XXX_API_rev9p3/API/Src/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register EVC_COUNT5
**/
#define EVC_COUNT5_ID                      0xf0018
#define EVC_COUNT5_LEN                     (4U)
#define EVC_COUNT5_MASK                    0xFFFFFFFFUL
#define EVC_COUNT5_EVC_SWCE_BIT_OFFSET (16U)
#define EVC_COUNT5_EVC_SWCE_BIT_LEN    (8U)
#define EVC_COUNT5_EVC_SWCE_BIT_MASK   0xff0000UL
#define EVC_COUNT5_EVC_HPW_BIT_OFFSET (0U)
#define EVC_COUNT5_EVC_HPW_BIT_LEN    (8U)
#define EVC_COUNT5_EVC_HPW_BIT_MASK   0xffU

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT6
**/
#define EVC_COUNT6_ID                      0xf001c
#define EVC_COUNT6_LEN                     (4U)
#define EVC_COUNT6_MASK                    0xFFFFFFFFUL
#define EVC_COUNT6_EVC_PREJ_BIT_OFFSET (0U)
#define EVC_COUNT6_EVC_PREJ_BIT_LEN    (12U)
#define EVC_COUNT6_EVC_PREJ_BIT_MASK   0xfffU



/******************************************************************************
* @brief Bit definitions for register TEST_CTRL0
**/
#define TEST_CTRL0_ID                        0xf0024
#define TEST_CTRL0_LEN                       (4U)
#define TEST_CTRL0_MASK                      0xFFFFFFFFUL
#define TEST_CTRL0_CIA_RUN_BIT_OFFSET    (26U)
#define TEST_CTRL0_CIA_RUN_BIT_LEN       (1U)
#define TEST_CTRL0_CIA_RUN_BIT_MASK      0x4000000UL
#define TEST_CTRL0_CIA_WDEN_BIT_OFFSET    (24U)
#define TEST_CTRL0_CIA_WDEN_BIT_LEN       (1U)
#define TEST_CTRL0_CIA_WDEN_BIT_MASK      0x1000000UL
#define TEST_CTRL0_HIRQ_POL_BIT_OFFSET       (21U)
#define TEST_CTRL0_HIRQ_POL_BIT_LEN          (1U)
#define TEST_CTRL0_HIRQ_POL_BIT_MASK         0x200000UL
#define TEST_CTRL0_TX_PSTM_BIT_OFFSET          (4U)
#define TEST_CTRL0_TX_PSTM_BIT_LEN             (1U)
#define TEST_CTRL0_TX_PSTM_BIT_MASK            0x10U

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT7
**/
#define EVC_COUNT7_ID                      0xf0028
#define EVC_COUNT7_LEN                     (4U)
#define EVC_COUNT7_MASK                    0xFFFFFFFFUL
#define EVC_COUNT7_EVC_VWARN_BIT_OFFSET  (16U)
#define EVC_COUNT7_EVC_VWARN_BIT_LEN     (8U)
#define EVC_COUNT7_EVC_VWARN_BIT_MASK    0xff0000UL
#define EVC_COUNT7_EVC_CPQE_BIT_OFFSET  (0U)
#define EVC_COUNT7_EVC_CPQE_BIT_LEN     (8U)
#define EVC_COUNT7_EVC_CPQE_BIT_MASK    0xffU

/******************************************************************************
* @brief Bit definitions for register SPI_MODE
**/
#define SPI_MODE_ID                          0xf002c
#define SPI_MODE_LEN                         (4U)
#define SPI_MODE_MASK                        0xFFFFFFFFUL
#define SPI_MODE_SPI_MODE_BIT_OFFSET         (0U)
#define SPI_MODE_SPI_MODE_BIT_LEN            (2U)
#define SPI_MODE_SPI_MODE_BIT_MASK           0x3U

/******************************************************************************
* @brief Bit definitions for register SYS_STATE_LO
**/
#define SYS_STATE_LO_ID                      0xf0030
#define SYS_STATE_LO_LEN                     (4U)
#define SYS_STATE_LO_MASK                    0xFFFFFFFFUL



/******************************************************************************
* @brief Bit definitions for register FCMD_STATUS
**/
#define FCMD_STATUS_ID                       0xf003c
#define FCMD_STATUS_LEN                      (4U)
#define FCMD_STATUS_MASK                     0xFFFFFFFFUL
#define FCMD_STATUS_FCMD_STATUS_BIT_OFFSET   (0U)
#define FCMD_STATUS_FCMD_STATUS_BIT_LEN      (5U)
#define FCMD_STATUS_FCMD_STATUS_BIT_MASK     0x1fU

/******************************************************************************
* @brief Bit definitions for register CTR_DBG
**/
#define CTR_DBG_ID                           0xf0048
#define CTR_DBG_LEN                          (4U)
#define CTR_DBG_MASK                         0xFFFFFFFFUL
#define CTR_DBG_CTR_DBG_BIT_OFFSET           (0U)
#define CTR_DBG_CTR_DBG_BIT_LEN              (32U)
#define CTR_DBG_CTR_DBG_BIT_MASK             0xffffffffUL

/******************************************************************************
* @brief Bit definitions for register SOFT_RST
**/
#define SOFT_RST_ID                          0x110000
#define SOFT_RST_LEN                         (4U)
#define SOFT_RST_MASK                        0xFFFFFFFFUL

/******************************************************************************
* @brief Bit definitions for register CLK_CTRL
**/
#define CLK_CTRL_ID                          0x110004
#define CLK_CTRL_LEN                         (4U)
#define CLK_CTRL_MASK                        0xFFFFFFFFUL
#define CLK_CTRL_LP_CLK_EN_BIT_OFFSET        (23U)
#define CLK_CTRL_LP_CLK_EN_BIT_LEN           (1U)
#define CLK_CTRL_LP_CLK_EN_BIT_MASK          0x800000UL
#define CLK_CTRL_GPIO_DRST_N_BIT_OFFSET  (19U)
#define CLK_CTRL_GPIO_DRST_N_BIT_LEN     (1U)
#define CLK_CTRL_GPIO_DRST_N_BIT_MASK    0x80000UL
#define CLK_CTRL_GPIO_DCLK_EN_BIT_OFFSET (18U)
#define CLK_CTRL_GPIO_DCLK_EN_BIT_LEN    (1U)
#define CLK_CTRL_GPIO_DCLK_EN_BIT_MASK   0x40000UL
#define CLK_CTRL_GPIO_CLK_EN_BIT_OFFSET      (16U)
#define CLK_CTRL_GPIO_CLK_EN_BIT_LEN         (1U)
#define CLK_CTRL_GPIO_CLK_EN_BIT_MASK        0x10000UL
#define CLK_CTRL_ACC_MCLK_EN_BIT_OFFSET   (15U)
#define CLK_CTRL_ACC_MCLK_EN_BIT_LEN      (1U)
#define CLK_CTRL_ACC_MCLK_EN_BIT_MASK     0x8000U
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_OFFSET    (12U)
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_LEN       (1U)
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_MASK      0x1000U
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_OFFSET    (11U)
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_LEN       (1U)
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_MASK      0x800U
#define CLK_CTRL_SAR_CLK_EN_BIT_OFFSET (10U)
#define CLK_CTRL_SAR_CLK_EN_BIT_LEN    (1U)
#define CLK_CTRL_SAR_CLK_EN_BIT_MASK   0x400U
#define CLK_CTRL_OTP_CLK_EN_BIT_OFFSET (9U)
#define CLK_CTRL_OTP_CLK_EN_BIT_LEN    (1U)
#define CLK_CTRL_OTP_CLK_EN_BIT_MASK   0x200U
#define CLK_CTRL_CIA_CLK_EN_BIT_OFFSET (8U)
#define CLK_CTRL_CIA_CLK_EN_BIT_LEN   (1U)
#define CLK_CTRL_CIA_CLK_EN_BIT_MASK  0x100U
#define CLK_CTRL_ACC_CLK_EN_BIT_OFFSET    (6U)
#define CLK_CTRL_ACC_CLK_EN_BIT_LEN       (1U)
#define CLK_CTRL_ACC_CLK_EN_BIT_MASK      0x40U
#define CLK_CTRL_TX_CLK_SEL_BIT_OFFSET       (4U)
#define CLK_CTRL_TX_CLK_SEL_BIT_LEN          (2U)
#define CLK_CTRL_TX_CLK_SEL_BIT_MASK         0x30U
#define CLK_CTRL_RX_CLK_SEL_BIT_OFFSET       (2U)
#define CLK_CTRL_RX_CLK_SEL_BIT_LEN          (2U)
#define CLK_CTRL_RX_CLK_SEL_BIT_MASK         0xcU
#define CLK_CTRL_SYS_CLK_SEL_BIT_OFFSET      (0U)
#define CLK_CTRL_SYS_CLK_SEL_BIT_LEN         (2U)
#define CLK_CTRL_SYS_CLK_SEL_BIT_MASK        0x3U

